#### BuiltInFailures.GenericMEPFailures Members

---

|  |
| --- |
| BuiltInFailures GenericMEPFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures GenericMEPFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CapsWereAddedWarning | X caps were added. |
| Public property Static member | CapWasAddedWarning | 1 cap was added. |
| Public property Static member | FailedToPlaceCapWarning | Failed to place cap on the open connector. |
| Public property Static member | FlowConfigMismatch | [Element Name]: It is not possible to calculate the flow since all the components in this system have the flow configuration set to Preset or System. At least one component is required to have the flow configuration set to Calculated. |
| Public property Static member | FlowDirectionMismatch | [Element Name]: It is not possible to calculate the flow since the flow direction mismatch. Please check flow direction on all equipment in this system. |
| Public property Static member | InlineEndoflineMismatch | [Element Name]: It is not possible to calculate the flow since there is inline equipment that is configured as end of line. Please check equipment in this system and make sure that the equipment connectors used inline have a global system classification and a calculated flow configuration. Global equipment connectors used inline should always be linked to each other. |
| Public property Static member | MaxWidthAndHeightReached | Maximum width and height reached during sizing |
| Public property Static member | SegmentIsTooShort | The segment is too short. |
| Public property Static member | SizingFailedZeroFlow | Sizing failed. Flow for section is 0. |
| Public property Static member | ValidatePHSegmentConnWarning | The placeholder curve will not be able to connect to the required fittings for placeholder convert |
| Public property Static member | ValidatePHSegmentLengthWarning | The placeholder curve is not long enough to support the required fittings for placeholder convert |

# See Also

BuiltInFailures GenericMEPFailures Class

Autodesk.Revit.DB Namespace